# AnalysisDisplayLegendSettings Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayLegendSettings Constructor
AnalysisDisplayLegendSettings Class See Also
---
Constructs a default instance of legend settings.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalysisDisplayLegendSettings()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
AnalysisDisplayLegendSettings()
```

# See Also
AnalysisDisplayLegendSettings Class
AnalysisDisplayLegendSettings Overload
Autodesk.Revit.DB.Analysis Namespace